{"dateScraped":"2021-06-29","dataSource":"Canon","url":"https://shop.usa.canon.com/shop/en/catalog/eos-1d-x-mark-iii-body","productName":"EOS-1D X Mark III Body","productSKU":"3829C002","productPrice":"6499.00","images":["https://shop.usa.canon.com/wcsstore/CanonB2BStoreFrontAssetStore/images/1dx_markiii_1_l.png","https://shop.usa.canon.com/wcsstore/CanonB2BStoreFrontAssetStore/images/1dx_markiii_2_l.png","https://shop.usa.canon.com/wcsstore/CanonB2BStoreFrontAssetStore/images/1dx_markiii_3_l.png","https://shop.usa.canon.com/wcsstore/CanonB2BStoreFrontAssetStore/images/1dx_markiii_4_l.png"],"overview":["The ultimate EOS is here, making way for a new era in autofocus speed, accuracy and precision - the EOS-1D X Mark III. Offering the highest level of performance an EOS DSLR has ever possessed, the EOS-1D X Mark III changes the game for serious photographers around the world, boasting a powerful new 20.1 Megapixel Full-frame CMOS sensor, combined with a cutting-edge new DIGIC X image processor, for truly outstanding stills and video. Track subjects with incredible focus using the new 191-point AF system - including innovative new Head Detection AF technology (EOS iTR*1 AF X) - along with faster continuous shooting speeds of up to 16 fps with the viewfinder and up to 20 fps in Live View mode. The EOS-1D X Mark III is also our most powerful DSLR for video to date, equipped with 4K 60p video capability, plus the option to shoot 5.5K RAW video or 10-bit 4:2:2 video with Canon Log, recorded to a CFexpress card in either or both of the available dual card slots. And, with built-in Wi-Fi®*** for the first time ever in an EOS-1D series, this revolutionary, dust and weather resistant camera offers the connectivity to share photos and videos with clients, colleagues or family from virtually anywhere. The EOS-1D X Mark III - raising the bar on pro DSLR quality and performance."],"features":["High Image Quality with New 20.1 Megapixel Full-frame CMOS Sensor Combined with Newly Designed low Pass Filter.","20.1 Megapixel Full-frame CMOS SensorFeaturing a Canon-developed 35mm full-frame CMOS sensor with approx. 20.1 effective megapixels, the EOS-1D X Mark III camera is engineered with a new imaging system, designed to capture sharp and detailed images, even in low-light scenarios. This results in noise reduction in dark portions of the image even at high ISO speeds, and increased sensitivity that contributes to the EOS-1D X Mark III's high-speed image capture rate, accelerating frame-to-frame performance. The new sensor also includes Dual Pixel CMOS AF for high-speed, precise AF during Live View still and movie recording.","Low Pass FilterThe EOS-1D X Mark III features a newly developed four-layer low pass filter that provides 16-point separation. This not only helps to suppress moiré and color distortion, but also improves resolution.","New DIGIC X Image Processor with an ISO range of 100-102400; Expandable to 50-819200*.","New DIGIC X Image ProcessorReplacing the two DIGIC 6+ processors from the previous EOS-1D X Mark II camera, The EOS-1D X Mark III camera is the first Canon EOS camera - in the DSLR series camera line - to feature a powerful new DIGIC X Image Processor, which helps to enhance fine detail from the added low-pass filter.","ISO range of 100-102400; Expandable to 50-819200Delivering high standard and expanded ISOs, and a score of options to enhance shooting in varied and fast-changing lighting situations, The EOS-1D X Mark III can shoot at expanded sensitivities down to ISO 50 (L) and up to 204800 (H1), 409600 (H2) and even 8192000 (H3) (for stills). Beyond the obvious advantages of its wide ISO range, the EOS-1D X Mark III has automatic ISO settings, found on the dedicated ISO menu. Minimum and maximum ISO settings can be specified, as can a user-defined range, plus full auto and manual.","New 191-point AF System Capable of Tracking the Subjects Head and Face using Deep Learning Technology.","The EOS-1D X Mark III camera is equipped with a collection of 191 AF points, which allows the photographer to manually select every point, as well as select a variety of AF Zone Area selections. Covering virtually the same amount of the picture area as the previous 61-point system AF array. The EOS-1D X Mark III camera also features a new technology called EOS iTR*1 AF X which helps to track a subject with excellent accuracy, including impressive Face Detection AF and new Head Detection AF - and even offers the added benefit of Eye Detection AF in Live View mode or while shooting video.","For additional information on how to use AF on the EOS-1D X Mark III,\ndownload our EOS-1D X Mark III AF Setting Guidebook .","Dual Pixel CMOS AF for Fast and Accurate Auto Focus using up to 3869 Manual AF Positions** and up to 525 Automatic Positions.","Dual Pixel CMOS AFAdding to its powerful internal design, and ideal for sports photography, the EOS-1D X Mark III camera's fast and intelligent Dual Pixel CMOS AF system features an incredible 3,869 manually selectable AF positions**, helping to ensure speedy, accurate and consistent AF all throughout approximately 90% x 100% of the image plane. Able to detect shifts in movement at the pixel level, Dual Pixel CMOS AF enables continuous automatic AF and AF tracking that enhances overall camera operation for sharp still images and smooth, accurate focus transitions in movies."]}