{"dateScraped":"2021-07-14","dataSource":"Sony","url":"https://electronics.sony.com/imaging/interchangeable-lens-cameras/all-interchangeable-lens-cameras/p/ilce1-b","productName":"Alpha 1 - Full-frame Interchangeable Lens Mirrorless Camera","productSKU":"ILCE-1","productPrice":"$6,499.99","images":["https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/2.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/3.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/4.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/6.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/7.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/8.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/9.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/10.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/11.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/12.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/13.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/14.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/15.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/16.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/17.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/18.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/19.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/20.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/21.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/22.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/23.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/24.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/25.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/26.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/27.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/28.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/29.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/30.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/31.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/34.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/35.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/36.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/37.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/38.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/39.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/40.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/41.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/44.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/45.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/46.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/47.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/48.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/49.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/50.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/51.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/52.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/53.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/54.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/55.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/57.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/58.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/59.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/60.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/61.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/62.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/63.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/64.png","https://d1ncau8tqf99kp.cloudfront.net/PDP/DI/Interchangeable-Lens-Cameras/ILCE/ILCE-1/desktop/65.png"],"overview":["50.1MP1 full-frame stacked Exmor RS™ CMOS sensor w/ integral memory","8x more powerful2, next generation BIONZ XR image processing engine","50.1MP RAW+JPEG up to 30fps3 w/ 120 AF/AE calculations per sec. 4","Blackout-free5 shooting up to 30fps3 from fast sensor readout speed","World’s first6 240 fps refresh rate, 9.44M1 dot 0.64” QXGA OLED EVF","World’s first6 anti-flicker mechanical and electronic shutter","Dual drive mechanical shutter for up to 1/400 sec. flash sync","Anti-distortion electronic shutter w/ flash sync7 up to 1/200 sec.","Silent, vibration free electronic shutter w/ all-in-one Silent Mode","Real-time AF tracking, Real-time Eye-AF (humans, animals, birds) 8","5-axis in-body image stabilization for 5.5-step9 advantage","Active Mode10 image stabilization for smooth handheld movie shooting","Low noise images w/ ISO up to 102,40011 and 15+stop dynamic range12","Incredible autofocus w/ 759 phase detection AF points13, 92% coverage","8.6K oversampling for 8K14 30p 10-bit 4:2:0 HDR w/ no pixel binning","Up to 4K 120p15 10-bit 4:2:2 and full pixel readout in all rec. modes","Up to 4K 120p15 in XAVC S (AVC), XAVC HS (HEVC) and XAVC S-I (All-I)","Up to 60p 4.3K 16-bit RAW movie output16 via HDMI Type-A connector","5.8K over sampling for 4K movie in Super 35mm format","Picture Profiles including S-Cinetone, HLG and S-Log 2 & 3","10 pre-set creative looks w/ 8 customizable parameters","No 29m 59s continuous recording limit for movie shooting","Dual card slots, both compatible with CFexpress Type A and SDXC/SDHC","Robust magnesium alloy body w/ dust and moisture resistant sealing17","New menu layout w/ intuitive 3 level structure and touch operation","199MP18 Pixel Shift Multi shooting w/ flash sync.7 up to 1/200 sec.","MI shoe w/ digital audio interface up to 4ch. 24bit capability19","Long life Z-battery extendable via USB Type C with Power Delivery","RAW file size options: Uncompressed, Lossless comp. and Compressed","Anti-distortion shutter reduces rolling shutter effect by 1.5x19","BIONZ XR, Visible Light and IR Sensor improve color and WB accuracy","Σ (sigma) graphite heatsink effectively dissipates internal heat","802.11ac 2x2 MIMO Wi-Fi delivers industry-leading6 transfer speed","Fast wired data transfer; 10Gbps SuperSpeed USB 3.2 / 1000BASE-T Ethernet","In-camera extraction of 33.2-megapixel stills from 8K movies"],"features":["The α missionThe α mission is to give creators the power to realize their dreams. The α1 is its most potent expression to date.","50 MP at 30fpsThe latest Sony technology delivers unprecedented speed and resolution for new creative possibilities and workflow.","A brilliant blend of resolution and speed","Overwhelming image quality","Incomparable AF","Unprecedented movie performance","Control and reliability for any scene","A new workflow solution for professional needs","50.1 megapixels at up to 30 frames/secondThe α1 offers an extraordinary combination of high resolution and blazing speed. Ultra-fast readout from the 50.1-MP sensor allows continuous bursts at up to 30fps 3 with AF and AE tracking using the electronic shutter. Perfect for sports or any situation where the critical action is over in an instant.","Blackout-free for an uninterrupted viewAn interrupted blackout-free view of the subject lets you respond instantly and seamlessly. The EVF is updated to minimize latency during continuous shooting.(A) Blackout-free Shooting (B) Shooting with blackouts","120 AF/AE tracking calculations per secondFast sensor readout enables 120 AF/AE calculations per second 4, even during 30fps bursts, for pinpoint AF tracking precision with fast and erratic subjects. AE latency is less than 0.033 s.(1) AF/AE calculations (2) 60 times/s (3) 20 frames/s","Silent, vibration-free shutter 4A silent electronic shutter provides greater opportunities for shooting sports and other subjects where noise is not tolerated. Vibration-free operation contributes to high image quality.","Anti-distortion ShutterFast sensor readout minimizes still-image distortion 5 20 when using the electronic shutter. The BIONZ XRTM engine and a large buffer achieve about 1.5x less distortion than the α9 II.[1] Conventional electronic shutter [2] Anti-distortion shutter","Flicker-free electronic & mechanical shuttersAnother world-first: 6 flicker-free electronic and mechanical shutters. You get flicker-free shooting under fluorescent/artificial lighting with all the benefits of the electronic shutter.Anti-flicker [1] OFF [2] ON","Full-frame stacked 50.1-MP Exmor RS™ CMOS sensor with integral memoryA stacked architecture in this back-illuminated 50.1-MP full-frame image sensor contributes to high resolution and speed. Separate pixel and circuit layers and advanced A/D conversion mean faster processing.","All-new architecture and BIONZ XR image processing engineThe new BIONZ XR engine features advanced architecture that delivers 8x greater processing power 2. The result is outstanding image quality as well as improved camera interface response.","Flash sync with electronic shutterFor the first time in an α camera, electronic shutter flash sync 7 is possible thanks to high readout speed from the stacked CMOS sensor. All electronic shutter advantages remain available for flash shooting.","Dual driven shutter drive for flash sync up to 1/400 s.The world's first 6 dual driven shutter system allows flash sync up to 1/400 s., making it easier to capture dynamic action, and opening the door to new creative possibilities.","Breathtaking resolution and image qualityThe new 50.1-MP Exmor RS CMOS sensor delivers high resolution and sensitivity with low noise, plus up to 15 stops 12 of dynamic range. A new image processing engine achieves even better color accuracy than previous models.","Wide ISO 100–32000 sensitivity range","Pixel Shift Multi Shooting","Creative Look supports varied expression","5-axis optical in-body image stabilization for a 5.5-step advantage","Despite the sensor's high pixel count, a sensitive back-illuminated structure with gapless on-chip lenses and an AR coated seal glass allows a standard ISO range of ISO 100–32000, expandable to ISO 50–102400. 11","Up to 16 images shot with precise in-body image stabilization control can be combined via computer software to create photos with up to 199 million pixels for extraordinary resolution, color, and atmosphere. 12[1] Normal Shooting [2] 16-image Pixel Shift Multi Shooting","The Creative Look feature provides 10 presets that can be used unmodified or edited to create a variety of \"looks\" that can help creators fine-tune the mood of their stills or movies in-camera.","A precision stabilization unit and gyro sensors plus the latest image stabilization algorithms deliver a 5.5-step 9 shutter speed advantage, maximizing the quality of high-resolution images.[1] Yaw [2] Pitch [3] Roll","Real-time Eye AF for birds 8High-level subject recognition technology now makes it possible for Sony's Real-time Eye AF function to track and accurately focus on bird eyes, even if the bird suddenly takes flight or the framing changes. This innovative function easily meets the many challenges of bird photography. 1","Improved Real-time Eye AF for animals 8","Real-time Eye AF","Real-time Tracking","Wide, fast, precise AF tracking","Primarily designed for cats and dogs, this feature employs advanced subject recognition technology to reliably track and focus on animal eyes. 1 It even works if the animal's face is upside-down.","Combining state-of-the-art AI technology and evolved Fast Hybrid AF algorithms, Real-time Eye AF in the α1 tracks and focuses on human eyes with approximately 30% greater precision than the α9 II.","Select a subject, half-press the shutter, and the camera will track and maintain focus automatically. Turn on AF face/eye priority for seamless AI-based tracking of human, animal, or bird eyes.","The α1 features focal plane phase-detection AF that is sensitive, fast, and precise. The 50.1-MP sensor and BIONZ XR engine provide 759 selectable phase-detection points 13 covering about 92% of the image.","Next-generation 8K 14 30p recordingThe new image sensor and BIONZ XR engine in the α1 deliver 8K 30p movie recording capability for extraordinary realism. Four times the resolution of 4K with full Real-time Tracking and Real-time Eye AF functionality. 8K footage is also ideally suited to flexible 4K editing.","4K movies at a high 120fps frame rate 15The α1 supports high frame-rate internal 4K movie recording at up to 120fps, for smooth, expressive slow-motion playback at up to 5x. 10-bit 4:2:2 chroma subsampling can be used with Long-GOP or Intra (All-I) compression for outstanding image quality, while the new image sensor and BIONZ XR engine minimize image distortion.","4K with full sensor readout, no pixel binning, and 5.8K oversamplingIn the Super 35 mode, approximately 2.3x the amount of data required for QFHD 4K is acquired through full-frame readout with no pixel binning, for beautifully imagery that is rich in detail.(A) 2.3 times information","10-bit 4:2:2 chroma subsampling10-bit depth, 4:2:2 chroma subsampling, a high-efficiency MPEG-H HEVC/H.265 codec, intra-frame coding, and more, support flexible editing and a variety of delivery formats.","Real-time Eye AF and Real-time Tracking for movies","S-Log for compatibility with pro cine cameras","The BIONZ XR engine features significantly improved detection, accurately tracking human eyes at a wider range of head angles. Also available for 8K and 4K 120p recording.","S-Log2 and S-Log3 are included. S-Log3 provides smooth 10-bit gradations and a dynamic range of 15+ stops. S-Gamut, S-Gamut3, and S-Gamut3.Cine color spaces supported.","10-bit 4:2:2 HLG (Hybrid Log-Gamma) supportHigh-dynamic-range HLG movies support the wide-gamut BT.2020 color space, and can be directly played on an HDR (HLG) compatible TV. 10-bit HLG recordings reproduce fine gradation and detail.[1] High flexibility to fine-tune images as desired (color grading required) [2] Instant high-quality image (color grading not required)","16-bit RAW outputThe α1 allows 16-bit RAW output to an external recorder via HDMI for improved post-production flexibility. RAW output via HDMI is available while recording 4K to internal card media.","Digital audio interface for superior soundA digital audio interface delivers outstanding audio quality with compatible audio devices connected via the Multi Interface Shoe. Pristine digital audio 19 is delivered directly to the camera.","Heat-dissipating structure for extended recordingA newly developed heat-dissipating structure prevents overheating during continuous recording without increasing body size. Record 8K/30p or 4K/60p video continuously for up to 30 minutes.","The cinematic S-Cinetone lookThe α1 includes the same S-Cinetone color matrix that produces beautiful color and skin tones in the VENICE, FX6, and other Cinema Line cameras. S-Cinetone delivers natural mid-tones that are essential to healthy-looking skin color, plus soft colors and gorgeous highlights, responding to a growing need for more expressive depth.","\"Active Mode\" image stabilization 10A new Active Mode dedicated to movie shooting makes 5-axis optical image stabilization highly effective for handheld shooting. It uses the BIONZ XR engine's real-time processing capability to apply optimum compensation in all formats, including 4K. All of this is realized without compromising the compact size and mobility of the α system.","High-performance electronic viewfinderThe 9.44 million-dot (approx.) OLED viewfinder in the α1 offers the highest resolution in the industry at this time 6. It features 0.90x magnification with a 41 ° FOV for a clear, wide view, and an updated structure that results in a 25-mm-high eyepoint. A 240fps refresh rate with UXGA FOV is another world-first, 6 for a clear view of fast action.","Panning shots with electronic shutterUsing electronic shutter at low shutter speeds can reduce display response, making it difficult to follow fast subjects. Turn [Low Frame Rate Limit] ON to improve display response and allow panning shots.","Seamlessly switch full-frame and APS-C formatsM and S size images have the same number of pixels and AF area in the full-frame and APS-C modes, so you can switch seamlessly between full-frame [M:21MP] and APS-C [M:21MP] while shooting the same scene.[1] Full Frame [2] APS-C","Separate settings for stills and moviesA subset of the settings now change according to the selected mode. This is ideal when you want to use different aperture, shutter speed, and other settings for shooting stills and movies.","New menu structureAnother feature requested by professional photographers and videographers: a revised menu structure for easier navigation, and touch-responsive menu operation for more intuitive control.","Customizable functions164 Functions are assignable to 17 custom keys as well as the front and rear dials. Independent function sets can be assigned for stills, movies and playback.","Touch menu controlTouch-responsive main and function menus with menu tabs on the left of the display, and related parameter groups and parameters on the right, make for easy navigation and tracking control.","High-reliability mechanical shutterShutter vibration is minimized while allowing continuous bursts at up to 10fps. The new shutter unit with advanced motor, brake, and dampers is good for more than 500,000 cycles.","Two CFexpress Type A-compatible media slotsDual media slots support UHS-I and UHS-II SDXC/SDHC cards as well as new CFexpress Type A cards for higher overall capacity and faster read/write speeds.","High-capacity Z-series battery for extended recordingShoot up to 530 stills per charge. Components and circuitry have also been designed to optimize power use. Get more capacity with two Z batteries in the VG-C4EM grip.","Improved dust- and moisture-resistant design 17Sealing is provided at all body seams and the battery cover. The media slots have a double sliding cover and lock that keep water out. A lens lock button and mount cushion help too.","Durable magnesium alloy chassisA light, rigid magnesium alloy enhances the durability of the top, front, and rear covers as well as the internal frame. 6 lens mount attachment screws add even more strength and rigidity.","Industry's fastest 6 built-in Wi-Fi supports 2x2 MIMOBuilt-in wireless LAN allows communication on the 2.4-GHz and 5-GHz bands, the latter with 2x2 MIMO support (IEEE 802.11a/b/g/n/ac). Dual antennas ensure reliable communication.","SuperSpeed USB 10-Gbps (USB 3.2) Type-C® connectorA USB Type-C® connector that supports fast USB 3.2 SuperSpeed USB 10-Gbps data transfer, making fast PC Remote (tethered) data transfer available for smooth handling of large files.","1000BASE-T Ethernet for fast communicationA built-in connector for wired 1000BASE-T connection enables fast, stable data transfers at gigabit speeds. FTPS is supported, allowing SSL or TLS encryption for greater security.","Versatile FTP connectivityFTP still and movie uploads as well as remote camera control can be accomplished via wireless LAN, fast wired LAN, or a USB-tethered smartphone. File types for transfer can be specified.","FTP transfer of still and movie filesStills and movies can be transferred to a remote FTP server via wireless LAN, high-speed wired LAN, or a wired smartphone connection. Wireless data throughput is about 3.5x faster than the α9 II.","Versatile remote (tethered) shooting functionsThe Imaging Edge Desktop \"Remote\" application can be used for PC Remote (tethered) shooting via a wireless LAN or wired USB connection. Remote control from a mobile device is also possible.","Lossless compressed RAWThe α1 includes efficient lossless compression in addition to compressed and uncompressed RAW.","New \"Light\" JPEG sizeA new \"Light\" JPEG size setting results in smaller files than the \"Standard\" setting, allowing faster delivery for news and sports photographers who depend on speed.","10-bit HEIF for smoother gradationsHEIF format can deliver smooth 10-bit gradations for more realistic reproduction of skies and portrait subjects. Advanced compression reduces file size for improved workflow efficiency.","Designed with the environment in mindSony is committed not only to offering products, services and content that deliver exciting experiences but also to working towards our goal of a zero environmental footprint throughout our business activities.Read more"]}