{"dataSource":"Fuji","dateScraped":"2021-06-30","url":"https://fujifilm-x.com/global/products/cameras/gfx-50s/","productName":"FUJIFILM GFX 50S","productSKU":"gfx-50s","productPrice":"Unknown","images":["https://fujifilm-x.com/wp-content/uploads/2019/10/gfx-50s_overview-feature01.jpg"],"overview":["The FUJIFILM GFX 50S delivers the world’s best image quality. It combines outstanding resolution of 51.4 megapixels with exceptional tones, advanced color reproduction and high-performance lenses. This level of image quality is purely motivational. The world around you changes the moment you hold this camera in your hand. Appreciate all that can be achieved with Fujifilm’s new medium format mirrorless camera system, GFX.","Sensor","43.8mm x 32.9mm","Efective Pixels","51.4M","Mount","G Mount","The biggest firmware upgrade in the history of GFX System.","Fujifilm developed the FUJIFILM GFX 50S and the FUJINON GF Lenses series as a system for photographers that require even higher image quality than can be covered by the current X Series lineup.","The world’s highest level of photographic image quality is produced by the integration of a large 43.8ｘ32.9mm CMOS sensor (FUJIFILM G Format) and image design technology cultivated by Fujifilm’s 80+ year history.","FUJIFILM GFX 50S overturns common perceptions of traditional medium format digital cameras with a small, lightweight body made of magnesium alloy and equipped with an ultra-high definition detachable EVF adopting a 3.69M-dot organic EL panel.","The focal plane shutter has been newly developed specifically for our mirrorless camera. While achieving a maximum shutter speed of 1/4000 sec. (1/16000 sec. when using electronic shutter), a flash synchronization speed of 1/125 sec. or less, and high performance and durability with a shutter endurance supporting up to 150,000 shots*, the camera also achieves low vibration and a quiet shutter noise.","The following Full HD settings are supported for Movie Mode: 1920×1080 29.97p/25p/24p/23.98p 36Mbps. Users can shoot high quality movies making use of the excellent color reproduction thanks to the shallow depth of field that is unique to large sensors and Film Simulation modes.","Dedicated G Mount FUJINON GF Lenses inherit the design philosophy of reputable XF Lenses, achieving extremely high resolving power and rich tone reproduction. In addition to the A (Auto) Position setting that featured on the aperture ring in the X Series, a new C (Command Dial) Position has been added, allowing for the aperture value to be changed even from the camera body.","Offers various dedicated accessories to construct a system that can respond to the detailed requests of professionals, users can select the solution that is easiest to use according to their shooting scene and method.","*1 According to Fujifilm internal testing.","Read more about our products in these downloadable PDF format brochures","The latest development roadmap for interchangeable lenses for the GFX Series"],"brochure":["https://dl.fujifilm-x.com/global/products/cameras/gfx-50s/pdf/gfx_catalogue_01.pdf"]}