{"dataSource":"Fuji","dateScraped":"2021-06-30","url":"https://fujifilm-x.com/global/products/cameras/gfx-50r/","productName":"FUJIFILM GFX 50R","productSKU":"gfx-50r","productPrice":"Unknown","images":["https://fujifilm-x.com/wp-content/uploads/2020/06/gfx-50r_overview-feature01.jpg"],"overview":["FUJIFILM has continued to develop and manufacture medium format film cameras. The priority has always been to achieve premium image quality. The GFX 50R is a rangefinder style, which has been reborn through the history of medium format cameras. Just like medium format film cameras in the past, the GFX 50R has been developed in pursuit of a compact and lightweight system while delivering the ultimate picture quality for everyday snapshots and street photography. This new model expands the potential for the GFX system and makes medium format output even more accessible.","Sensor","43.8mm x 32.9mm","Efective Pixels","51.4M","Mount","G Mount","The biggest firmware upgrade in the history of GFX System.","Just like medium format film cameras in the past, the FUJIFILM GFX 50R has been developed in pursuit of a compact and lightweight system while delivering the ultimate picture quality for everyday snapshots and street photography. This new model expands the potential for the GFX system and makes medium format output even more accessible.","The FUJIFILM 50R is equipped with 51.4MP medium format CMOS sensor and X-Processor Pro image processing engine.","The FUJIFILM GFX system delivers image quality among the best in the industry. It combines outstanding resolution of 51.4 megapixels with exceptional tones, advanced color reproduction and high-performance lenses.","The focal plane shutter has been newly developed specifically for our mirrorless camera. While achieving a maximum shutter speed of 1/4000 sec. (1/16000 sec. when using electronic shutter), a flash synchronization speed of 1/125 sec. or less, and high performance and durability with a shutter endurance supporting up to 150,000 shots*1, the camera also achieves low vibration and a quiet shutter noise.","The GFX 50R is equipped with the 0.77x 3.69M-dot organic EL electronic viewfinder (EVF). This allows accurate focusing despite the large size of the medium format sensor, which has a shallower depth of field than that of a 35mm full frame sensor when shooting at the same angle of view.","This is the first model in the GFX system to support the Bluetooth® low energy technology. Captured images can be transferred easily and quickly to smartphones and tablet devices paired with the camera via the FUJIFILM Camera Remote app.","*1 According to Fujifilm internal testing.","Read more about our products in these downloadable PDF format brochures","The latest development roadmap for interchangeable lenses for the GFX Series"],"brochure":["https://dl.fujifilm-x.com/global/products/cameras/gfx-50s/pdf/gfx_catalogue_01.pdf"]}