{"dataSource":"Fuji","dateScraped":"2021-06-30","url":"https://fujifilm-x.com/global/products/cameras/gfx100/","productName":"FUJIFILM GFX100","productSKU":"gfx100","productPrice":"Unknown","images":["https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_kv_01_01.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_kv_01_01.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_kv_01_02.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_kv_01_02.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_kv_02_01.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_kv_02_01.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_kv_02_02.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_kv_02_02.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_kv_03_01.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_kv_03_01.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_kv_03_02.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_kv_03_02.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/common/kv_camera.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_device.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_device.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_device_large.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_device_large.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_slide_03.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_slide_01.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_slide_02.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_slide_03.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_slide_01.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/common/overlay_simulation.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/voice/eric_malo.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_toughness.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_toughness.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/body_01.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/body_01.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/body_02.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/body_02.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_workflow.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_workflow.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/voice/jan_gonzales.png?ver=1.2","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_focus.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_focus.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/common/overlay_focus.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_youtube_thumb.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/btn_play.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/voice/pal_Laukli.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/image/image_accessory.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/image/image_accessory.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/common/image_farmware.png","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/common/navi_farm_e.png?2106","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/common/navi_farm_sp_e.png?2106","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/pc/banner_01.jpg","https://fujifilm-x.com/products-cameras-static/gfx100/assets/images/top/sp/banner_01.jpg"],"overview":["GFX100 combines decades of experience, knowledge, and research into a mirrorless large format camera that redefines the boundaries and limitations of how photographers and filmmakers creatively express themselves.","By raising the bar in large format auto-focus performance, being one of the first large format systems to have in-body stabilization, and providing filmmakers with a way to push the limits of wide format 4K/30p motion capture, GFX100 is not only reshaping how images are being made, but it is also redefining large format for the world’s next generation of image makers.","GFX100 pairs a back-illuminated 102MP imaging sensor with our blazingly fast X Processor 4 processing engine to create a combination capable of outputting 16-bit images with amazing color fidelity, rich shadow detail, and incredible dynamic range. Its back-illuminated structure enhances image quality by bringing the exposure plane closer to the color filter array. This minimizes noise levels from that typically experienced with mirrorless cameras and extends the native ISO to ISO 100. Sharpness is also enhanced, while moire and false colors are near eliminated through the omission of an optical low-pass filter. Lastly, the inclusion of a motion sensor retention mechanism suppresses even the slightest vibrations that may be caused by camera shake or the even the movement of the shutter.","ACROS","Fujifilm’s legacy in color science has helped create one of the most widely-acclaimed digital color processing engines in the world. Benefiting from over 85 years of research and development in color imaging, GFX100 utilizes the same venerated color processing engine found in other X Series and GFX System digital cameras to output images as JPEGS; or even as 16-bit TIFF or RAW files, with incredible color reproduction and detail. Also, choose from 18 different Film Simulation modes, built upon Fujifilm’s heritage and color science know-how, to achieve an artistic vision and even adjust parameters such as tone, dynamic range, clarity, and various effects directly in camera to create special recipies entirely in-camera","With the GFX100, my large-format fine art prints have improved enormously in quality and this is reflected by my collectors. The incredible dynamic of the image, the quality of the color ranges, and the great resolution have allowed me to edit very large formats with unmatched quality. And with the 5-axis stabilization of the GFX and with the PDAF pixels on the entire sensor, I regained mobility and ease of work that I had lost with the medium format. The GFX100 is an extremely versatile device that allows me to take it on all terrains and all types of projects, from reporting to the studio. FUJIFILM’s Film Simulation is superb and allows me to choose a superb colorimetry right from the shooting, despite the fact that I shoot in RAW because I will be able to find and modify these film simulation choices in the post-shooting image processing software.","GFX100 is an elegant blend of engineering and design. Everything from the shape of its lightweight magnesium body, to the look and feel of its buttons and dials have been carefully selected to provide you with a seamless experience in using it to create images. Optimized for a variety of applications and packed with state-of-the art technology, GFX100 is designed to provide you with the best incredible image quality possible, regardless of the situation.","Tethered Support for Capture One Professionals Everywhere: Tethered capture is a necessity for many professional large format camera users and the GFX100 works with Capture One software to help photographers create, manage, and maintain a streamlined workflow from capture through to delivery. With Capture One, raw Fujifilm images can be processed quickly with the option to apply Fujifilm’s unique Film Simulations during file conversion for even greater artistic possibilities.","The GFX100 is a Game Changer in the large format arena. It’s fast, portable, and very reliable without any compromise on the images it puts out. Elevating the user experience as a whole.\nI am an X user for years and the transition to the GFX100 is way too familiar with its intuitive controls. The grip feels right in my hand and the button placement is exactly where it should be. The ability to assign button functions to suit my preference makes it even better.\nOne major advantage of using the GFX100 large format system is the dynamic range it can capture. It helps me use lesser artificial lighting than usual. With IBIS, it enables me to shoot handheld on low light conditions with lower ISO settings while still producing tack sharp images, thus both improving my workflow drastically.","Compared to traditional large format digital systems, GFX100 raises the bar in auto-focus performance by utilizing AF phase detection pixels across most of the sensor to help photographers obtain focus wherever they choose to position their subjects in the frame. At approximately 100% coverage, increased auto-focus performance with speed and accuracy is now a complete reality for photographers needing optimum performance in subject tracking, face/ eye detection and low-contrast environments.","While digital cinema has pushed into the world of large format (35mm x 24mm), limited options still exist for creatives interested in big sensors. With a sensor size of 43.9mm x 32.9mm, GFX100 offers filmmakers a viable alternative in achieving their creative visions. The sensor and processor combination supports 4K video recording at 30p/10bit to create a uniquely cinematic, large format look for cinematographers who want exceptional control over depth of field and film-like tonality. With the ability to apply Fujifilm’s highly respected Film Simulations, record in F-Log Rec 2020, capture 10-bit, 4:2:2 uncompressed footage, and even RAW video data, through the HDMI port, GFX100 should certainly be coming soon to a screen near you.","GFX100 is the best production camera ever made, period! To be able to shoot medium format photography, and large format film in the same body has completely transformed the way we work. Add to that the excellent, fast, and accurate autofocus capabilities of the camera and the GFX100 becomes something of a miracle. On earlier medium format systems I’ve owned, there was no focus selection, no continuous focus, and definitely no face recognition. This system does it all, and then some. We don’t normally work with a lot of movement on stills, but when we, for example, shoot models moving, having autofocus we can trust is essential. For us, the continuous focus really comes into play when we shoot film. It just works! Being able to switch between film and stills instantly is a really great feature that is used almost on every project, as we do both on most projects these days. Whenever I deliver the files to a postproduction studio, the colorists are always amazed by the quality of the movie files.","GFX100 is designed to be used with a broad range of accessories that support a wide range of image making applications. Attach an H Mount lens or us a view camera adapterfor large-format lenses for in-studio applications, or use FUJFILM branded flash accessories, like EF-X500 and EF-60, to extend your creativity.","Read more about our products in these downloadable PDF format brochures","The latest development roadmap for interchangeable lenses for the GFX Series"],"brochure":["https://dl.fujifilm-x.com/global/products/cameras/gfx100/pdf/gfx100_catalogue_01.pdf"]}