{"dataSource":"Fuji","dateScraped":"2021-07-01","url":"https://fujifilm-x.com/global/products/cameras/gfx100s/","productCategory":"Camera","productName":"FUJIFILM GFX100S","productSKU":"gfx100s","productPrice":"Unknown","images":["https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_kv_camera_02_landscape.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_kv_camera_02_portrait.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_kv_camera_01_landscape.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_kv_camera_01_portrait.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_kv_head_01_landscape.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_kv_head_01_portrait.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_kv_bg_01.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_concept_thum_01.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_creativity_img_01_left.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_creativity_img_01_right.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_creativity_img_02_pc.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_resolution_image_02.jpg","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_resolution_image_01.jpg","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_bokeh_image_01.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_tonality_img_01.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_mobility_img_01_pc.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_portability_img_01_pc.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_performance_img_01_pc.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_easeofuse_img_01.png","https://fujifilm-x.com/products-cameras-static/gfx100s/assets/images/top/wapk_banner_01_pc.jpg"],"overview":["As photographers, we strive for perfection,\nconstantly searching for the highest image quality and optimum control in what we create.\nGFX100S combines these two invaluable attributes in one remarkably compact and lightweight body.\nIt is an imaging tool like no other; a new generation of large format camera to suit a new generation of creatives.","The 102-megapixel large format sensor works in harmony with G Mount lenses to produce images with\nincredible details, beautifully smooth gradations, and wonderfully accurate colors,\nall while ensuring that you are at the center of your creative universe.\nThere’s honestly no better way to realize your vision.","GFX100S is not full-frame. It is so much more than that.","More Creativity*1","Enjoy unparalleled control over the images created by the 102MP ultra-high resolution imaging sensor at the heart of GFX100S and use its unmatched flexibility to create the images that you have always dreamed of, down to the smallest of details. Using a back-illuminated design that – along with its family of GF lenses – optimizes light capture for every image at each one of its 102 million pixels, the full majesty of this camera is truly realized once the image data is passed through the quad-core X-Processor 4 imaging engine. This is what ultimately delivers the unsurpassed image quality and outstanding color reproduction that has now become synonymous with Fujifilm.","When the Finer Moments Matter Most","Detail Where it Matters","Use GFX100S to create remarkably detailed images that reach further and deeper into scenes to reveal amazing color fidelity and rich shadow detail, all with enough dynamic range to allow for astonishing push and pull adjustments in post-production. It’s time to start telling stories in a whole new way by creating images with a level of detail that’s hard to imagine is possible.","Bokeh-filled Backgrounds","Portrait perfection is within reach. Enjoy the unique look of large format by combining GFX100S with fast aperture GF lenses to selectively focus and achieve outstanding background separation and creamy transitions. What’s in focus is supremely sharp and what isn’t falls off into a pleasing smoothness that gives a beautiful overall effect to the image.","More Colors on Display","Experience unparalleled color accuracy thanks to GFX100S’s ability to output 16-bit images. Almost imperceptible shifts in color tones are recorded by the camera’s large format sensor and delivered in incredible true-to-life images with up to 281 trillion colors all on display.","True Flexibility in the Field","Whether you are scrambling after a couple to frame their perfect moment or trekking through the wilderness to document nature’s biggest secrets, rest assured that GFX100S has your back when you get there. Its compact size and powerful in-body image stabilization (IBIS) will help make handheld images pin-sharp, while a cutting-edge focus algorithm and phase detection autofocus (PDAF) pixels across the entire frame deliver fast and accurate autofocus. Be confident that you’ll never miss the moment, no matter how fleeting it may be.","Compact and Comfortable","With GFX100S, there are no compromises, not even with weight. At just 900g (1.98lbs), it’s compact enough to carry with you wherever you go and with its secure grip and ergonomic button and dial layout, comfortable in-hand to let you focus on making your best images.","Create with Confidence","Despite it being almost twice the physical size of any full-frame imaging sensor, GFX100S houses its 102MP Bayer array inside of a compact, weather-resistant camera body that is smaller in size to some Full Frame cameras. It also some how does this with enough room left over to pack in a five-axis image stabilization system that provides up to six stops of vibration compensation*2. It’s time to move away from the tripod, have the confidence to work handheld in large format, and be safe in the knowledge that the results will be as sharp and detailed as they would be if the camera were locked and stationary on a support.","Focus for any Occasion","GFX100S redefines what is possible in terms of autofocus speed and accuracy for large format cameras. With highly accurate phase detection pixels across approximately 100% of the frame, reliable Face/Eye detection, responsive subject tracking for moving subjects, and incredible low-light focusing capabilities, this is truly a camera for any focusing occasion.","Intuitive and Familiar","At roughly the same physical size as some full-frame cameras, but with a 102MP imaging sensor twice as large in physical size, GFX100S breaks from large format convention with a wonderfully approachable and intuitive design. In addition to the deliberate ergonomic choices to prioritize in-hand comfort, the camera also blends a top-plate PASM dial with customizable function (Fn) buttons, which will make it familiar to both new and existing X Series users. Simply customize the camera’s buttons and dials to your liking and then move on to create your next amazing image.","More than Just Stills","GFX100S isn’t just a remarkable machine for stills photographers, it offers broadcast-quality video capture, too, making it a truly multifaceted marvel. Record up to 4K/30p footage in 10-bit F-Log or 12-bit Apple ProRes RAW, with an incredibly beautiful depth-of-field, for a look that is made for the silver screen.","Shot on X"],"brochure":[]}