{"dataSource":"Fuji","dateScraped":"2021-07-01","url":"https://fujifilm-x.com/global/products/lenses/xf18mmf14-r-lm-wr/","productCategory":"Camera","productName":"XF18mmF1.4 R LM WR ","productSKU":"xf18mmf14-r-lm-wr","productPrice":"Unknown","images":["https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_ytthum_haoi.jpg","https://fujifilm-x.com//products-lenses-static/xf18mmf14-r-lm-wr/global/assets/images/bg_img_02.png","https://fujifilm-x.com//products-lenses-static/xf18mmf14-r-lm-wr/global/assets/images/bg_img_02_sp.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_00_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_01_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_02_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_03_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_04_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_05_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_06_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_07_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_08_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_09_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_10_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_00_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_01_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_02_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_anim_11_haoi.png","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_img03_haoi.jpg","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_img04_haoi.jpg","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_img05_haoi.jpg","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_img07_haoi.jpg","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_img08_haoi.jpg","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_img09_haoi.jpg","https://fujifilm-x.com/wp-content/uploads/2021/04/xf18mmf14-r-lm-wr_img10_haoi.jpg","https://dl.fujifilm-x.com/global/products/lenses/xf18mmf14-r-lm-wr/assets/lh_xf18mmf14-r-lm-wr01_haoi.jpg"],"overview":["Get up close and wide open with Fujifilm’s versatile FUJINON XF18mmF1.4 R LM WR, a professional, portable, and weather-resistant prime lens. With a focal length equivalent to 27mm, it’s the perfect choice for sprawling landscapes, the sights and sounds of the street, and everything else in between. Be ready for any creative outburst with lightning fast autofocus, a wide F1.4 aperture, and unmatched optical design. XF18mmF1.4 R LM WR is ready to go wherever your adventures take you and fully capable of extracting every last bit of detail from your X Series mirrorless camera.","Great images may always start with a good idea, but only FUJINON lenses like XF18mmF1.4 R LM WR can bring those ideas to life in full FUJIFILM color. With a 35mm equivalent focal length of 27mm and a wide, versatile aperture of F1.4, photographers and filmmakers will be compelled to make images that get the most from XF18mmF1.4’s remarkable resolving capabilities. Every moment matters, from the ones we find in spontaneous street adventures to the ones we discover in meticulously planned nature excursions. Regardless of the destination, XF18mmF1.4 is the obvious choice for anyone who cares about image quality as much as they do about telling stories.","It takes a lot to design and engineer a wide-angle lens that produces beautifully sharp images from corner to corner, with little-to-no distortion at the frame’s edges. XF18mmF1.4 R LM WR accomplishes this difficult task by using 15 lens elements - that also include one ED and three aspherical elements - to minimize optical aberrations. This produces an image that is incredibly sharp and completely true to the story you want to tell.","Bringing images into focus may require a little bit of time and luck every now and then, but they almost always require consistent and reliable autofocus. That’s why XF18mmF1.4 R LM WR uses a linear autofocus (AF) motor to provide consistent autofocus results. The first XF wide angle prime lens to use this solution, this precise internal system drives all six focusing elements as one, delivering responsive, near-silent AF down to a minimum object distance of just 7.9in (20cm) in as little as 0.04 seconds.","XF18mmF1.4 R LM WR's stunning image quality is perfectly complemented by the beautiful bokeh created at F1.4 by its rounded aperture blades. This intersection of engineering and design provides total control over an image and opens up a wide, new world of creativity that starts with the superb separation this lens creates between a subject and their background.","For those situations that require a more personal touch, XF18mmF1.4 R LM WR's manual focusing ring provides smooth, even rotation from one end to the other. This makes pulling focus a breeze when recording video and selective focus simple when photographing through objects like prisms and loupes. Regardless whether it’s done manually or with autofocus, XF18mmF1.4 will make sure you’re ready to frame that perfect moment, so the only luck you'll need is being in the right place at the right time.","Creativity shouldn’t stop when bad weather starts, which is why XF18mmF1.4 R LM WR is fully designed to be resistant to the elements. A total of eight weather-resistant seals protect it from dust, moisture, and temperatures down to -10°C (14°F). This means you can keep going when others are forced to go home. The addition of an ‘A’ position lock on the aperture ring gives additional peace of mind for those times you really need to lose yourself in the art of creating your best images.","XF18mmF1.4 R LM WR has a perfect field of view in so many ways. It lets you be close to your subject, yet lets you get so much into the frame at the same time.","XF18mmF1.4 R LM WR focuses like magic. It's lightning fast.\nI haven't even had to think about autofocus.","XF18mmF1.4 R LM WR is one of the best image quality among XF lenses that I have used.\nWith this lens, you could portray anything. You can shoot environmental portrait, cityscape, landscape, architecture, or even macro photography."],"brochure":[]}