{"dateScraped":"2021-06-25","dataSource":"Panasonic","url":"https://shop.panasonic.com/cameras-and-camcorders/cameras/DC-LX100M2.html","productName":"LUMIX LX100 II with 24-75mm LEICA DC Lens","productSKU":"DC-LX100M2DC-LX100M2","productPrice":"999.99","images":["https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dw2f4d8f37/product/images/DC-LX100M2_ALT01.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dw061ed682/product/images/DC-LX100M2_ALT02.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dwb34ff24c/product/images/DC-LX100M2_ALT03.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dwaab5bfd6/product/images/DC-LX100M2_ALT04.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dw761ca66e/product/images/DC-LX100M2_ALT05.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dwa7ebb357/product/images/DC-LX100M2_ALT06.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dwd128d0ed/product/images/DC-LX100M2_ALT07.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dw233a2e37/product/images/DC-LX100M2_ALT08.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dwe2f140022/product/images/DC-LX100M2_ALT09.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dw5367422f/product/images/DC-LX100M2_ALT10.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dw647f1246/product/images/DC-LX100M2_ALT11.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dw2f8c7934/product/images/DC-LX100M2_ALT12.jpg?sw=400&sh=400&sm=fit","https://shop.panasonic.com/dw/image/v2/AASQ_PRD/on/demandware.static/-/Sites-shop-pna-master-catalog/default/dw708acc0c/product/images/DC-LX100M2_ALT13.jpg?sw=400&sh=400&sm=fit"],"overview":["17 MP [4:3 aspect] high-sensitivity multi-aspect four thirds MOS sensor. 4:3, 3:2, 16:9, 1:1 multi-aspect modes taken from 21.77 megapixel total count*.","Leica DC 24-75mm lens [F1.7-2.8], with POWER O.I.S. [Optical Image Stabilizer]","24p / 30p 4K video and exclusive 4K PHOTO modes plus focus stacking.  ","Electronic Viewfinder EVF [2,764k-dot], and large 3-inch touch sensitive monitor [1240k-dot]","Classic external manual exposure and camera operation controls. "],"features":["LUMIX LX100 II features large Four Thirds sensor technology in Panasonic’s world-renowned LX high-end compact camera series.The LUMIX LX100 II offers a 17.0-megapixel in 4:3 aspect. Even the finest details can be precisely captured with the increased resolution of the new sensor. Along with a full hybrid photography experience with 24p / 30p 4K video and exclusive 4K PHOTO modes plus focus stacking and 4K pre-burst, the LUMIX LX100 II delivers improved photo capture modes, Bluetooth 4.2, Wi-Fi 2.4GHz and a near DSLR-like photo experience with traditional lens-mounted and body-mounted exposure controls.  The LEICA DC VARIO-SUMMILUX lens (35mm camera equivalent: 24-75mm) comprises 11 elements in 8 groups, including 2 ED lenses and 5 aspherical lenses with 8 aspherical surfaces with POWER O.I.S. (Optical Image Stabilizer). The lens boasts F1.7-F2.8 high speed light capture and high descriptiveness in detail and resolution to corners. Together with the large MOS Sensor it also produces stunningly beautiful defocus.DISCLAIMERS:  LEICA DC lenses are manufactured using measurement instruments and quality assurance systems certified by Leica Camera AG based on the company's quality standards. The Bluetooth word mark is a registered trademark owned by the Bluetooth SIG, Inc. and any use of such marks by Panasonic Corporation is under license. Other trademarks and trade names are those of their respective owners.(*)Total 21.77 megapixel sensor count. 17.0 megapixels recorded in 4:3 aspect ratio.","Built for Camera EnthusiastsCamera enthusiasts will appreciate the aperture ring and shutter speed dial. Looking through the viewfinder, your right hand naturally finds the exposure compensation dial. The LUMIX LX100 II interfaces with you in a way that makes sense, while also making photography more satisfying.","Classic Refined Body StylingWith its new premium grip and refined body styling, the LUMIX LX100 II encourages you to pick it up, shoot with it and carry it with you everywhere. Plus, the camera's upper case comes with a shiny black finish that recalls classic camera design to further emphasize its classic refinement.","Multiple Aspect Ratios — a LUMIX ExclusiveFour Thirds 17MP multi-aspect sensor that is 1.6 times the imaging area of a 1-inch sensor,* Four Thirds offers wider dynamic range and lower noise from low-light high ISO settings.The sensor supports multiple aspect ratios. Leveraging effective pixels across a wide area, the camera gives you access to 4:3, 3:2, and 16:9 without any change in focal length. A dedicated switch on the lens barrel lets you switch intuitively between aspect ratios and enjoy composing shots with complete freedom.","F1.7–2.8 LEICA DC VARIO-SUMMILUX LensThe LEICA DC VARIO-SUMMILUX boasts F1.7 brightness at the wide-angle end and F2.8 at the telephoto end for natural-looking bokeh. The versatile focal range goes from 24mm at wide-angle for dynamic landscapes to 75mm* at mid-telephoto for artistic portraits.","Large 0.7x Eye FinderAn integrated LVF (Live View Finder) helps you concentrate on framing the scene. The LUMIX LX100 II LVF is 0.38-inch with high 2,760k-dot-equivalent resolution and 0.7x high magnification (35mm camera equivalent).","Post Focus / Focus StackingPanasonic's 4K technology gives you the remarkable ability to refocus an image even after it has been taken. After shooting select the in-focus area with the Post Focus function. Or adjust the depth of field after shooting with the Focus Stacking function.","4K PHOTO Auto MarkingThe Auto Marking function helps choose your best shots more easily. The camera detects motion or a human face and automatically sets a marker to enhance your creativity.4K PHOTO Sequence CompositionSequence Composition helps make the 4K PHOTO feature even more creative. A unique composite photo can be produced by synthesizing multiple 4K PHOTO images.","4K VideoA leader in 4K technology, Panasonic integrates 4K recording capability into a highly compact body. It allows you to record your precious memories in 3,840 x 2,160 pixel videos — 4 times more pixels than full HD.","Faster AFDFD (Depth From Defocus) technology instantly calculates the distance to the subject by evaluating two images with different sharpness levels. This achieves fast auto-focus and 5.5 fps burst shooting with AFC to help you capture even the most fleeting photo opportunities. 11 fps burst shooting with AFS is also available.","Enhusiast Monochrome OptionsL. Monochrome and L. Monochrome D are new monochrome modes in Photo Style that feature even finer gradations. Along with Monochrome, it gives you the dynamic control to help take black-and-white expressiveness to the next level. Each of these modes can also be combined with Grain Effect at Low, Standard or High level.","Macro Shooting as Close as 3cmThe LUMIX LX100 II delivers macro photography at 3cm at wide-angle and 30cm at telephoto. Photographs of flowers, plants and more reveal the fine details nearly invisible to the naked eye.","The Venus EngineThe Venus Engine leverages the ultra-high resolution of the LUMIX LX100 II to reproduce photos with crisp contrast, expressive colors and realistic textures. With a no low-pass filter, the design minimizes such artifacts as moiré patterns and false colors. The result is a camera designed for breathtaking image quality.","Remote Control — Bluetooth 4.2 / Wi-Fi®Bluetooth 4.2 (Low Energy) enables shutter release and video record start/stop via a smartphone or tablet. You can also use the Panasonic Image App for Android/iOS to control functions like zoom and focus and to share images on social media via Wi-Fi®.• The Wi-Fi CERTIFIED™ Logo is a certification mark of Wi-Fi Alliance®. • The Bluetooth® word mark and logos are registered trademarks owned by Bluetooth SIG, Inc. and any use of such marks by Panasonic Corporation is under license. Other trademarks and trade names are those of their respective owners.","AC/USB Power ChargingThe battery can be recharged either via AC or USB according to your convenience."]}